Revit 2027 API
LoadedFamilyIntegrityCheck Class
 Functions for checking the integrity of loaded families.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.LoadedFamilyIntegrityCheck
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class LoadedFamilyIntegrityCheck
Public NotInheritable Class LoadedFamilyIntegrityCheck
public ref class LoadedFamilyIntegrityCheck abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type LoadedFamilyIntegrityCheck = class end
The LoadedFamilyIntegrityCheck type exposes the following members.
Methods
Name | Description
CheckAllFamilies |  Check that all families loaded in the host document have their content documents.
CheckAllFamiliesSlow |  Check integrity of content documents of all families loaded in the host document.
CheckFamily |  Check that the loaded family has its content document.
Top
See Also
Reference
Autodesk.Revit.DB Namespace